HELP = '''Привет, {full_name}! :)

У этого бота есть три команды:
- /help — отправляет это сообщение
- /join — позволяет присоединиться к существующей игре
- /create — позволяет создать новую игру'''

NO_GAME = 'Игра с идентификатором {game_id} не найдена'

ALREADY_JOINED = 'Вы уже присоединились к игре {game_id}!'

JOINED_GAME = 'Вы присоединились к игре {game_id}. Осталось свободных мест: {free_count}.'

GAME_START = 'Игра начата, ваша роль: {role}'

GAME_CREATED = '''Вы успешно создали игру.
Общее число игроков: {user_count}
Список ролей: {roles}

Идентификатор игры: {game_id}
'''

USED_ADDED = '''Вы добавили новую роль.
Общее число игроков: {user_count}
Список ролей: {roles}

Введите "старт" чтобы закончить добавлние ролей
'''

ALREADY_CREATING = 'Вы уже создаёте игру!'

JOIN_HELP = 'Введите идентификатор игры для вступления в игру'

CREATE_HELP = '''Вы начали создавать новую игру
Введите роли, которые требуется добавить в и игру, по одной в сообщении.

Введите "старт" чтобы закончить добавлние ролей
'''
